---
type: DocumentWorksharingEnabledEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# DocumentWorksharingEnabledEventArgs

`Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDocument | 2015 | `public Document GetDocument ()` |